app/Controllers/LaporanController.php

SELECT *
FROM `gudang`
WHERE `nama_gudang` != 'Overpack'
SELECT *
FROM `produk`
---
    public function mutasi()
    {
        $data = [
            'title' => 'Laporan Mutasi Stok',
            'gudang_list' => $this->gudangModel->where('nama_gudang !=', 'Overpack')->findAll(),
            'produk_list' => $this->produkModel->findAll()