app/Controllers/OperpackKemasUlangController.php

    public function input()
    {
        $data = [
            'title' => 'Form Input Hasil Kemas Ulang',
            'produk_list' => $this->produkModel->findAll()
---
SELECT *
FROM `produk`

    public function riwayat()
    {
        $data = [
            'title' => 'Riwayat Kemas Ulang',
            'produk_list' => $this->produkModel->findAll()
---
SELECT *
FROM `produk`