app/Controllers/OperpackKerusakanController.php

    public function getGudangInternal()
    {
        $gudangList = $this->gudangModel->where('tipe_gudang', 'Produksi')
                                       ->orderBy('nama_gudang')
                                       ->findAll();
---
SELECT *
FROM `gudang`
WHERE `tipe_gudang` = 'Produksi'
ORDER BY `nama_gudang`