app/Controllers/OperpackKerusakanController.php

SELECT *
FROM `produk`
ORDER BY `nama_produk` ASC
---
    public function form()
    {
        $data = [
            'title' => 'Form Penerimaan Barang Rusak',
            'produk_list' => $this->produkModel->orderBy('nama_produk', 'ASC')->findAll()