app/Models/AdminModel.php

SELECT `kode_barang`, `nama_barang`, `satuan`, `konversi`, `utama`
FROM `tbl_barang`
ORDER BY `nama_barang` ASC
---
    public function getBarangList()
    {
        $builder = $this->db->table('tbl_barang');
        $builder->select('kode_barang, nama_barang, satuan, konversi, utama');
        $builder->orderBy('nama_barang', 'ASC');
        return $builder->get()->getResultArray();