app/Models/GudangModel.php

SELECT *
FROM `gudang`
ORDER BY `nama_gudang` ASC
---
    public function getGudangList()
    {
        return $this->orderBy('nama_gudang', 'ASC')->findAll();

SELECT *
FROM `gudang`
WHERE `tipe_gudang` = 'Produksi'
ORDER BY `nama_gudang` ASC
---
    public function getGudangProduksi()
    {
        return $this->where('tipe_gudang', 'Produksi')
                    ->orderBy('nama_gudang', 'ASC')
                    ->findAll();