app/Models/LaporanMutasiModel.php

SELECT `id_produk`, `nama_produk`, `satuan_per_dus` as `isi`
FROM `produk`
ORDER BY `nama_produk`
---
    public function getMutasiStok(array $filters)
    {
        try {
            $tipe_laporan = $filters['tipe_laporan'] ?? 'harian';
            $tgl_laporan = $filters['tanggal'] ?? date('Y-m-d');
            $tgl_mulai = $filters['tanggal_mulai'] ?? date('Y-m-01');
            $tgl_akhir = $filters['tanggal_akhir'] ?? date('Y-m-t');
            $filter_gudang = $filters['gudang_id'] ?? 'semua';
            $filter_produk = $filters['produk_id'] ?? 'semua';

            $tanggal_hitung_awal = ($tipe_laporan === 'harian') ? $tgl_laporan : $tgl_mulai;
            $tanggal_akhir_hitung = ($tipe_laporan === 'harian') ? $tgl_laporan : $tgl_akhir;

            // Ambil daftar produk
            $builder = $this->db->table('produk');
            $builder->select('id_produk, nama_produk, satuan_per_dus as isi');

            if ($filter_produk !== 'semua') {
                $builder->where('id_produk', $filter_produk);
            }

            $builder->orderBy('nama_produk');
            $produk_list = $builder->get()->getResultArray();

SELECT SUM(jumlah_dus_opname) as total_dus, SUM(jumlah_satuan_opname) as total_satuan
FROM `stok_awal_bulan`
WHERE `produk_id` = 15
AND DATE_FORMAT(tanggal_opname, '%Y-%m') = '2025-07'
---
    private function getSaldoAwalBenar(int $id_produk, string $tanggal_hitung_awal, $filter_gudang)
    {
        try {
            $bulan_tahun_laporan = date('Y-m', strtotime($tanggal_hitung_awal));

            // Cari opname bulan ini
            $builder = $this->db->table('stok_awal_bulan');
            $builder->select('SUM(jumlah_dus_opname) as total_dus, SUM(jumlah_satuan_opname) as total_satuan');
            $builder->where('produk_id', $id_produk);
            $builder->where("DATE_FORMAT(tanggal_opname, '%Y-%m')", $bulan_tahun_laporan);

            if ($filter_gudang !== 'semua') {
                $builder->where('gudang_id', $filter_gudang);
            }

            $opname_data = $builder->get()->getRowArray();

SELECT SUM(jumlah_dus) as total_dus, SUM(jumlah_satuan) as total_satuan
FROM `pengemasan`
WHERE `produk_id` = 15
AND DATE(tanggal) >= '2025-07-22'
AND DATE(tanggal) <= '2025-07-22'
---
    private function hitungProduksi(array &$data, int $id_produk, string $tgl_mulai, string $tgl_akhir, $filter_gudang)
    {
        $builder = $this->db->table('pengemasan');
        $builder->select('SUM(jumlah_dus) as total_dus, SUM(jumlah_satuan) as total_satuan');
        $builder->where('produk_id', $id_produk);
        $builder->where('DATE(tanggal) >=', $tgl_mulai);
        $builder->where('DATE(tanggal) <=', $tgl_akhir);

        if ($filter_gudang !== 'semua') {
            $builder->where('gudang_id', $filter_gudang);
        }

        $result = $builder->get()->getRowArray();

SELECT `o`.`gudang_asal_id`, `o`.`gudang_tujuan_id`, SUM(od.jumlah_dus_dikirim) as total_dus, SUM(od.jumlah_satuan_dikirim) as total_satuan
FROM `operstock` `o`
JOIN `operstock_detail` `od` ON `o`.`id` = `od`.`operstock_id`
WHERE `od`.`produk_id` = 15
AND DATE(o.waktu_kirim) >= '2025-07-22'
AND DATE(o.waktu_kirim) <= '2025-07-22'
AND `o`.`gudang_asal_id` != 4
AND `o`.`gudang_tujuan_id` != 4
GROUP BY `o`.`gudang_asal_id`, `o`.`gudang_tujuan_id`
---
    private function hitungOperstock(array &$data, int $id_produk, string $tgl_mulai, string $tgl_akhir, $filter_gudang)
    {
        $builder = $this->db->table('operstock o');
        $builder->select('o.gudang_asal_id, o.gudang_tujuan_id, SUM(od.jumlah_dus_dikirim) as total_dus, SUM(od.jumlah_satuan_dikirim) as total_satuan');
        $builder->join('operstock_detail od', 'o.id = od.operstock_id');
        $builder->where('od.produk_id', $id_produk);
        $builder->where('DATE(o.waktu_kirim) >=', $tgl_mulai);
        $builder->where('DATE(o.waktu_kirim) <=', $tgl_akhir);
        $builder->where('o.gudang_asal_id !=', 4);
        $builder->where('o.gudang_tujuan_id !=', 4);
        $builder->groupBy('o.gudang_asal_id, o.gudang_tujuan_id');

        $results = $builder->get()->getResultArray();

SELECT SUM(pd.jumlah_dus) as total_dus, SUM(pd.jumlah_satuan) as total_satuan
FROM `penjualan` `p`
JOIN `penjualan_detail` `pd` ON `p`.`id` = `pd`.`penjualan_id`
WHERE `pd`.`produk_id` = 15
AND DATE(p.tanggal) >= '2025-07-22'
AND DATE(p.tanggal) <= '2025-07-22'
---
    private function hitungPenjualan(array &$data, int $id_produk, string $tgl_mulai, string $tgl_akhir, $filter_gudang)
    {
        $builder = $this->db->table('penjualan p');
        $builder->select('SUM(pd.jumlah_dus) as total_dus, SUM(pd.jumlah_satuan) as total_satuan');
        $builder->join('penjualan_detail pd', 'p.id = pd.penjualan_id');
        $builder->where('pd.produk_id', $id_produk);
        $builder->where('DATE(p.tanggal) >=', $tgl_mulai);
        $builder->where('DATE(p.tanggal) <=', $tgl_akhir);

        if ($filter_gudang !== 'semua') {
            $builder->where('pd.gudang_id', $filter_gudang);
        }

        $result = $builder->get()->getRowArray();

SELECT SUM(od.jumlah_dus_dikirim) as total_dus, SUM(od.jumlah_satuan_dikirim) as total_satuan
FROM `operstock` `o`
JOIN `operstock_detail` `od` ON `o`.`id` = `od`.`operstock_id`
WHERE `od`.`produk_id` = 15
AND DATE(o.waktu_kirim) >= '2025-07-22'
AND DATE(o.waktu_kirim) <= '2025-07-22'
AND `o`.`gudang_asal_id` = 4
---
    private function hitungOverpack(array &$data, int $id_produk, string $tgl_mulai, string $tgl_akhir, $filter_gudang)
    {
        // Overpack masuk
        $builder = $this->db->table('operstock o');
        $builder->select('SUM(od.jumlah_dus_dikirim) as total_dus, SUM(od.jumlah_satuan_dikirim) as total_satuan');
        $builder->join('operstock_detail od', 'o.id = od.operstock_id');
        $builder->where('od.produk_id', $id_produk);
        $builder->where('DATE(o.waktu_kirim) >=', $tgl_mulai);
        $builder->where('DATE(o.waktu_kirim) <=', $tgl_akhir);
        $builder->where('o.gudang_asal_id', 4);

        if ($filter_gudang !== 'semua') {
            $builder->where('o.gudang_tujuan_id', $filter_gudang);
        }

        $result = $builder->get()->getRowArray();