app/Models/LaporanModel.php

SELECT *
FROM `gudang`
WHERE `id_gudang` = '1'
---
    public function getMutasiStok($tipe_laporan, $tgl_laporan, $tgl_mulai, $tgl_akhir, $filter_gudang, $filter_produk)
    {
        $data = [
            'report_data' => [],
            'warehouse_columns' => ['P1', 'P2', 'P3'],
            'totals' => [
                'saldo_awal_dus' => 0, 'saldo_awal_satuan' => 0,
                'produksi_dus' => 0, 'produksi_satuan' => 0,
                'penerimaan_dus' => 0, 'penerimaan_satuan' => 0,
                'pengeluaran_dus' => 0, 'pengeluaran_satuan' => 0,
                'saldo_akhir_dus' => 0, 'saldo_akhir_satuan' => 0
            ]
        ];

        // Get warehouse columns based on filter
        if ($filter_gudang !== 'semua') {
            $gudang = $this->db->table('gudang')->where('id_gudang', $filter_gudang)->get()->getRowArray();