app/Models/LaporanStokModel.php

SELECT `p`.`id_produk`, `p`.`nama_produk`, `p`.`satuan_per_dus`, SUM(COALESCE(s.jumlah_dus, 0)) as final_dus, SUM(COALESCE(s.jumlah_satuan, 0)) as final_satuan
FROM `produk` `p`
LEFT JOIN `stok_produk` `s` ON `p`.`id_produk` = `s`.`id_produk`
GROUP BY `p`.`id_produk`, `p`.`nama_produk`, `p`.`satuan_per_dus`
ORDER BY `p`.`nama_produk` ASC
---
    private function getCurrentStok($filter_gudang, $search_produk)
    {
        if ($filter_gudang === 'semua') {
            $builder = $this->db->table('produk p');
            $builder->select('p.id_produk, p.nama_produk, p.satuan_per_dus, SUM(COALESCE(s.jumlah_dus, 0)) as final_dus, SUM(COALESCE(s.jumlah_satuan, 0)) as final_satuan');
            $builder->join('stok_produk s', 'p.id_produk = s.id_produk', 'left');

            if (!empty($search_produk)) {
                $builder->like('p.nama_produk', $search_produk);
            }

            $builder->groupBy('p.id_produk, p.nama_produk, p.satuan_per_dus');
            $builder->orderBy('p.nama_produk', 'ASC');
        } else {
            $builder = $this->db->table('produk p');
            $builder->select('p.id_produk, p.nama_produk, p.satuan_per_dus, COALESCE(s.jumlah_dus, 0) as final_dus, COALESCE(s.jumlah_satuan, 0) as final_satuan');
            $builder->join('stok_produk s', 'p.id_produk = s.id_produk AND s.id_gudang = ' . (int)$filter_gudang, 'left');

            if (!empty($search_produk)) {
                $builder->like('p.nama_produk', $search_produk);
            }

            $builder->orderBy('p.nama_produk', 'ASC');
        }

        return $builder->get()->getResultArray();