app/Models/OperpackKemasUlangModel.php

SELECT `vso`.`hasil_seleksi_aman`, `vso`.`hasil_kemas_ulang`, (vso.hasil_seleksi_aman - vso.hasil_kemas_ulang) as stok_aman_siap_repack_pcs, `p`.`satuan_per_dus`, `p`.`nama_produk`
FROM `view_stok_overpack` `vso`
JOIN `produk` `p` ON `vso`.`id_produk` = `p`.`id_produk`
WHERE `vso`.`id_produk` = 1
---
    public function getStokRepack(int $produk_id): array
    {
        if ($produk_id <= 0) {
            return [
                'hasil_seleksi_aman' => 0,
                'hasil_kemas_ulang' => 0,
                'stok_aman_siap_repack_pcs' => 0,
                'satuan_per_dus' => 1,
                'max_unit' => 0,
                'sisa_pcs' => 0,
                'unit_type' => 'satuan',
                'unit_label' => 'Satuan/Pcs',
                'nama_produk' => ''
            ];
        }

        $result = $this->db->table('view_stok_overpack vso')
            ->select('vso.hasil_seleksi_aman, vso.hasil_kemas_ulang, (vso.hasil_seleksi_aman - vso.hasil_kemas_ulang) as stok_aman_siap_repack_pcs, p.satuan_per_dus, p.nama_produk')
            ->join('produk p', 'vso.id_produk = p.id_produk')
            ->where('vso.id_produk', $produk_id)
            ->get()->getRowArray();

SELECT `k`.`id`, `k`.`tanggal`, `pr`.`nama_produk`, `k`.`jumlah_kemas`
FROM `operpack_kemas_ulang` `k`
JOIN `produk` `pr` ON `k`.`produk_id` = `pr`.`id_produk`
WHERE `k`.`tanggal` >= '2025-07-01'
AND `k`.`tanggal` <= '2025-07-31'
ORDER BY `k`.`tanggal` DESC, `k`.`id` DESC
---
    public function getRiwayat(array $filters): array
    {
        $builder = $this->db->table('operpack_kemas_ulang k')
            ->select('k.id, k.tanggal, pr.nama_produk, k.jumlah_kemas')
            ->join('produk pr', 'k.produk_id = pr.id_produk')
            ->where('k.tanggal >=', $filters['tanggal_mulai'])
            ->where('k.tanggal <=', $filters['tanggal_akhir']);

        if ($filters['produk_id'] !== 'semua') {
            $builder->where('k.produk_id', (int)$filters['produk_id']);
        }

        return $builder->orderBy('k.tanggal', 'DESC')->orderBy('k.id', 'DESC')->get()->getResultArray();

SELECT `k`.`id`, `k`.`produk_id`, `k`.`tanggal`, `k`.`jumlah_kemas`, `p`.`nama_produk`, `p`.`satuan_per_dus`
FROM `operpack_kemas_ulang` `k`
JOIN `produk` `p` ON `k`.`produk_id` = `p`.`id_produk`
WHERE `k`.`id` = 10
SELECT (hasil_seleksi_aman - hasil_kemas_ulang) as stok_siap_kemas
FROM `view_stok_overpack`
WHERE `id_produk` = '1'
---
    public function getDetailWithStok(int $id): ?array
    {
        $data = $this->db->table('operpack_kemas_ulang k')
            ->select('k.id, k.produk_id, k.tanggal, k.jumlah_kemas, p.nama_produk, p.satuan_per_dus')
            ->join('produk p', 'k.produk_id = p.id_produk')
            ->where('k.id', $id)
            ->get()->getRowArray();

        if ($data) {
            // Hitung stok siap kemas
            $stokOverpack = $this->db->table('view_stok_overpack')
                ->select('(hasil_seleksi_aman - hasil_kemas_ulang) as stok_siap_kemas')
                ->where('id_produk', $data['produk_id'])
                ->get()->getRowArray();

SELECT *
FROM `operpack_kemas_ulang`
WHERE `operpack_kemas_ulang`.`id` = 10
SELECT `p`.`satuan_per_dus`, `g`.`id_gudang`
FROM `produk` `p`
JOIN `gudang` `g` ON `g`.`nama_gudang` = 'Overpack'
WHERE `p`.`id_produk` = '1'
SELECT (hasil_seleksi_aman - hasil_kemas_ulang) as stok_siap_kemas
FROM `view_stok_overpack`
WHERE `id_produk` = '1'
---
    public function updateKemasUlang(int $id, int $newKemas): array
    {
        $this->db->transBegin();

        try {
            $oldData = $this->find($id);
            if (!$oldData) {
                throw new \Exception("Data lama tidak ditemukan.");
            }

            // Get product info
            $produkInfo = $this->db->table('produk p')
                ->select('p.satuan_per_dus, g.id_gudang')
                ->join('gudang g', "g.nama_gudang = 'Overpack'", 'cross')
                ->where('p.id_produk', $oldData['produk_id'])
                ->get()->getRowArray();

            if (!$produkInfo) {
                throw new \Exception("Data produk/gudang Overpack tidak ditemukan.");
            }

            $satuanPerDus = $produkInfo['satuan_per_dus'] > 0 ? (int)$produkInfo['satuan_per_dus'] : 1;
            $idGudangOverpack = $produkInfo['id_gudang'];

            // Validasi kelipatan untuk dus
            if ($satuanPerDus > 1 && ($newKemas % $satuanPerDus != 0)) {
                throw new \Exception("Jumlah kemas ($newKemas) harus kelipatan dari satuan per dus ($satuanPerDus).");
            }

            // Cek stok tersedia
            $stokOverpack = $this->db->table('view_stok_overpack')
                ->select('(hasil_seleksi_aman - hasil_kemas_ulang) as stok_siap_kemas')
                ->where('id_produk', $oldData['produk_id'])
                ->get()->getRowArray();

UPDATE `stok_produk` SET `jumlah_dus` = jumlah_dus + 1, `jumlah_satuan` = jumlah_satuan + 0
WHERE `id_produk` = '1'
AND `id_gudang` = '4'
UPDATE `operpack_kemas_ulang` SET `jumlah_kemas` = 48
WHERE `operpack_kemas_ulang`.`id` IN (10)
---
            $perubahanSatuan = $selisihPcs % $satuanPerDus;

            // Update stok produk
            $this->db->table('stok_produk')
                ->where('id_produk', $oldData['produk_id'])
                ->where('id_gudang', $idGudangOverpack)
                ->set('jumlah_dus', 'jumlah_dus + ' . $perubahanDus, false)
                ->set('jumlah_satuan', 'jumlah_satuan + ' . $perubahanSatuan, false)
                ->update();

            // Update data kemas ulang
            $this->update($id, ['jumlah_kemas' => $newKemas]);

INSERT INTO `operpack_kemas_ulang` (`produk_id`, `tanggal`, `jumlah_kemas`) VALUES (1, '2025-07-18', 24)
SELECT *
FROM `gudang`
WHERE `nama_gudang` = 'Overpack'
---
                'jumlah_kemas' => $jumlahKemasPcs
            ];

            $this->insert($insertData);

            // Tambahkan stok ke Gudang Overpack
            $gudangOverpack = $this->db->table('gudang')->where('nama_gudang', 'Overpack')->get()->getRowArray();

UPDATE `stok_produk` SET `jumlah_dus` = jumlah_dus + 1, `jumlah_satuan` = jumlah_satuan + 0
WHERE `id_produk` = 1
AND `id_gudang` = '4'
---
            }

            // Update stok produk
            $this->db->table('stok_produk')
                ->where('id_produk', $idProduk)
                ->where('id_gudang', $idGudangOverpack)
                ->set('jumlah_dus', 'jumlah_dus + ' . $dusTambah, false)
                ->set('jumlah_satuan', 'jumlah_satuan + ' . $satuanTambah, false)
                ->update();