app/Models/PengemasanModel.php

SELECT `p`.`id_produk`, `p`.`satuan_per_dus`
FROM `produk` `p`
JOIN `tbl_jenis_produksi` `j` ON `p`.`nama_produk` = `j`.`group_jenis_produksi`
WHERE `j`.`nom_jenis_produksi` = '21'
---
    public function simpanPengemasan(array $data)
    {
        $this->db->transBegin();

        try {
            $item_diproses = false;
            foreach ($data['items'] as $item) {
                if (empty($item['jumlah']) || $item['jumlah'] <= 0 || empty($item['gudang']) || empty($item['mesin']) || empty($item['jenis_produksi'])) continue;

                $item_diproses = true;
                $nom_jenis_produksi = $item['jenis_produksi'];

                $data_produk_db = $this->db->table('produk p')
                    ->select('p.id_produk, p.satuan_per_dus')
                    ->join('tbl_jenis_produksi j', 'p.nama_produk = j.group_jenis_produksi')
                    ->where('j.nom_jenis_produksi', $nom_jenis_produksi)
                    ->get()->getRowArray();

INSERT INTO `pengemasan` (`tanggal`, `shift`, `gudang_id`, `mesin`, `produk_id`, `jumlah_dus`, `jumlah_satuan`) VALUES ('2025-07-17T05:05', '1', 1, 'P1-M1', '16', 6, 0)
---
                    $this->db->table('stok_produk')->insert(['id_produk' => $id_produk, 'id_gudang' => (int)$item['gudang'], 'jumlah_dus' => $perubahan_dus, 'jumlah_satuan' => $perubahan_satuan]);
                }

                $this->db->table('pengemasan')->insert(['tanggal' => $data['tTanggal'], 'shift' => $data['tShift'], 'gudang_id' => (int)$item['gudang'], 'mesin' => $item['mesin'], 'produk_id' => $id_produk, 'jumlah_dus' => $perubahan_dus, 'jumlah_satuan' => $perubahan_satuan]);

SELECT `pg`.`id`, `pg`.`tanggal`, `pg`.`shift`, `pg`.`mesin`, `pr`.`nama_produk`, `g`.`nama_gudang`, `pg`.`jumlah_dus`, `pg`.`jumlah_satuan`
FROM `pengemasan` `pg`
JOIN `produk` `pr` ON `pg`.`produk_id` = `pr`.`id_produk`
JOIN `gudang` `g` ON `pg`.`gudang_id` = `g`.`id_gudang`
WHERE DATE(pg.tanggal) >= '2025-07-01'
AND DATE(pg.tanggal) <= '2025-07-31'
ORDER BY `pg`.`tanggal` DESC, `pg`.`id` DESC
---
    public function getRiwayat(array $filters)
    {
        $builder = $this->db->table('pengemasan pg')
            ->select('pg.id, pg.tanggal, pg.shift, pg.mesin, pr.nama_produk, g.nama_gudang, pg.jumlah_dus, pg.jumlah_satuan')
            ->join('produk pr', 'pg.produk_id = pr.id_produk')
            ->join('gudang g', 'pg.gudang_id = g.id_gudang')
            ->where('DATE(pg.tanggal) >=', $filters['tgl_mulai'])
            ->where('DATE(pg.tanggal) <=', $filters['tgl_akhir']);

        if ($filters['gudang_id'] !== 'semua') $builder->where('pg.gudang_id', $filters['gudang_id']);
        if ($filters['produk_id'] !== 'semua') $builder->where('pg.produk_id', $filters['produk_id']);

        return $builder->orderBy('pg.tanggal', 'DESC')->orderBy('pg.id', 'DESC')->get()->getResultArray();