app/Models/ProdukModel.php

SELECT *
FROM `produk`
ORDER BY `nama_produk` ASC
---
    public function getProdukList()
    {
        return $this->orderBy('nama_produk', 'ASC')->findAll();

SELECT `nom_jenis_produksi`, `jenis_produksi`
FROM `tbl_jenis_produksi`
ORDER BY `jenis_produksi` DESC
---
    public function getJenisProduksi()
    {
        return $this->db->table('tbl_jenis_produksi')
            ->select('nom_jenis_produksi, jenis_produksi')
            ->orderBy('jenis_produksi', 'DESC')
            ->get()->getResultArray();